[
  {
    "image": "https://i.ibb.co.com/4RHnbJ9N/focus-flow.png",
    "title": "FocusFlow",
    "companyName": "MindSpark Labs",
    "id": 1,
    "description": "FocusFlow by MindSpark Labs is a modern productivity app built to help you reclaim your attention and work with purpose. Combining elegant time tracking with guided deep‑focus sessions, FocusFlow creates a serene and distraction‑free workspace for maximum concentration. Using principles of the Pomodoro technique, you can customize focus and break intervals, track completed sessions, and review analytical insights into your daily performance. Smart, minimal notifications remind you when to pause or resume, helping maintain a healthy rhythm between effort and rest.\n\nThe app’s standout feature is its immersive environment. Choose from custom themes and calming ambience sounds—rain, forest, or ocean waves—to craft your ideal workspace. Detailed time analytics visualize how long and how consistently you stay focused, letting you refine your routine. For those struggling with motivation, FocusFlow includes gamified rewards and streaks to make building focus fun and measurable.\n\nWhether you’re studying, coding, writing, or managing tasks, FocusFlow adapts to your needs, serving as a personal focus coach that encourages discipline without stress. Elegant design, insightful tracking, and mindful sessions come together to help you think clearly, stay motivated, and work smarter every day.",
    "size": 85,
    "reviews": 47,
    "ratingAvg": 4.4,
    "downloads": 1.82,
    "ratings": [
      { "name": "1 star", "count": 125 },
      { "name": "2 star", "count": 210 },
      { "name": "3 star", "count": 390 },
      { "name": "4 star", "count": 680 },
      { "name": "5 star", "count": 1026 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/zhFhpRDG/note-nest.png",
    "title": "NoteNest",
    "companyName": "FeatherSoft",
    "id": 2,
    "description": "NoteNest by FeatherSoft is a vibrant and modern note‑taking app designed to help you capture ideas, organize projects, and collaborate effortlessly. It transforms everyday note‑keeping into a colorful, shareable workspace where creativity meets structure. With NoteNest, you can create topic‑based notebooks, add to‑do lists, attach images or links, and color‑code each note for instant clarity.\n\nThe app’s intuitive design encourages visual organization while keeping your workspace neat and distraction‑free. You can easily categorize ideas, track progress, and view all your notes in one seamless dashboard. Collaboration is simple — share your notes or entire notebooks with colleagues, study partners, or friends, making teamwork more dynamic and transparent.\n\nNoteNest’s smart sync feature ensures all your thoughts stay secure and up to date across every device, so inspiration is never lost. Rich text formatting, quick search, and easy sorting tools make managing multiple projects a breeze.\n\nWhether you’re brainstorming, planning assignments, or tracking daily goals, NoteNest adapts to your creative rhythm. Its blend of color, collaboration, and clarity turns ordinary note‑taking into an inspiring experience — a digital nest where your best ideas take flight.",
    "size": 60,
    "reviews": 66,
    "ratingAvg": 4.6,
    "downloads": 2.46,
    "ratings": [
      { "name": "1 star", "count": 98 },
      { "name": "2 star", "count": 155 },
      { "name": "3 star", "count": 410 },
      { "name": "4 star", "count": 890 },
      { "name": "5 star", "count": 1657 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/N2fVyJGr/fit-trail.jpg",
    "title": "FitTrail",
    "companyName": "TrailForge",
    "id": 3,
    "description": "FitTrail by TrailForge is an all‑in‑one fitness and outdoor companion designed for adventurers, runners, and explorers who love the open path.\n\nIt helps you discover scenic trails, track detailed workout stats, and share your fitness journey with a thriving community of like‑minded enthusiasts. FitTrail by TrailForge is an all‑in‑one fitness and outdoor companion designed for adventurers, runners, and explorers who love the open path.\n\nIt helps you discover scenic trails, track detailed workout stats, and share your fitness journey with a thriving community of like‑minded enthusiasts.",
    "size": 120,
    "reviews": 25,
    "ratingAvg": 4.1,
    "downloads": 9.64,
    "ratings": [
      { "name": "1 star", "count": 140 },
      { "name": "2 star", "count": 120 },
      { "name": "3 star", "count": 280 },
      { "name": "4 star", "count": 310 },
      { "name": "5 star", "count": 300 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/fd205qdm/meal-muse.png",
    "title": "MealMuse",
    "companyName": "ChefsCode",
    "id": 4,
    "description": "MealMuse by ChefsCode is an innovative recipe app that transforms your everyday ingredients into delicious, chef‑worthy meals. Designed for creativity and convenience, MealMuse helps you make the most of what’s already in your kitchen—no extra grocery run required.\n\nSimply enter the ingredients you have at home, and the app’s smart recipe generator instantly suggests a variety of dishes tailored to your pantry. Whether you’re cooking on a budget, short on time, or just feeling inventive, MealMuse sparks culinary inspiration with easy, step‑by‑step recipes that match your taste and available supplies.\n\nBeyond smart recipe generation, the app includes cooking tips, substitutions, and nutritional details, ensuring your dishes are both flavorful and balanced. You can save your favorite recipes, share them with friends, and explore trending community‑created meals for new ideas.\n\nWith MealMuse, cooking becomes effortless, rewarding, and fun. Turn simple ingredients into extraordinary meals, discover fresh inspiration every day, and let your inner chef shine right at home.",
    "size": 45,
    "reviews": 59,
    "ratingAvg": 4.7,
    "downloads": 7.24,
    "ratings": [
      { "name": "1 star", "count": 20 },
      { "name": "2 star", "count": 30 },
      { "name": "3 star", "count": 110 },
      { "name": "4 star", "count": 270 },
      { "name": "5 star", "count": 460 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/bMk65gnb/sleep-sync.png",
    "title": "SleepSync",
    "companyName": "DreamWare",
    "id": 5,
    "description": "SleepSync by DreamWare is an intelligent sleep companion designed to help you understand your sleep patterns and achieve truly restorative rest. Combining advanced sleep tracking with peaceful soundscapes, SleepSync transforms your nights into moments of relaxation and calm.\n\nUsing smart sensors and motion analysis, SleepSync monitors your sleep cycles, providing detailed insights into duration, depth, and quality. The app’s analytics dashboard highlights when you fall asleep fastest, wake up most often, and how your habits affect nighttime recovery. Personalized tips and bedtime reminders guide you toward healthier routines, ensuring consistent, high‑quality rest.\n\nDrift off with a curated library of soothing sounds — from soft rain and ocean waves to gentle piano and ambient tones — crafted to create the perfect sleep environment. You can set fade‑out timers, mix sounds, and even match them with your sleep goals.\n\nWith SleepSync, sleep becomes smart, seamless, and serene. Wake up refreshed, relaxed, and ready to take on your day — because better nights build brighter mornings.",
    "size": 76,
    "reviews": 73,
    "ratingAvg": 4.5,
    "downloads": 0.05,
    "ratings": [
      { "name": "1 star", "count": 130 },
      { "name": "2 star", "count": 140 },
      { "name": "3 star", "count": 360 },
      { "name": "4 star", "count": 880 },
      { "name": "5 star", "count": 1540 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/gbQ31K0z/budget-bee.png",
    "title": "BudgetBee",
    "companyName": "HiveTech",
    "id": 6,
    "description": "BudgetBee by HiveTech is a simple yet powerful personal finance app designed to make money management effortless and enjoyable. With its clean interface and delightful, colorful charts, BudgetBee helps you track expenses, monitor savings, and stay in control of your finances without the stress.\n\nEasily record daily transactions, categorize your spending, and visualize where your money goes. The app’s smart analytics transform complex financial data into clear insights through beautiful pie charts and bar graphs, giving you an instant overview of your habits. You can set budgets for categories like food, travel, or bills, and receive gentle reminders before you overspend.\n\nBudgetBee’s seamless experience ensures all your data stays synced across devices for real‑time tracking. Its goal‑setting feature motivates you to save smarter — whether it’s for a trip, a gadget, or an emergency fund. Privacy and data security are HiveTech’s top priorities, so your financial details stay safe in your hive.\n\nWith BudgetBee, staying financially organized becomes as enjoyable as watching your savings grow. Track smarter, save better, and let your financial journey buzz with clarity and confidence.",
    "size": 50,
    "reviews": 61,
    "ratingAvg": 4.2,
    "downloads": 1.27,
    "ratings": [
      { "name": "1 star", "count": 130 },
      { "name": "2 star", "count": 180 },
      { "name": "3 star", "count": 370 },
      { "name": "4 star", "count": 520 },
      { "name": "5 star", "count": 650 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/wFBc9Xyt/story-view.png",
    "title": "StoryView",
    "companyName": "LitPixel",
    "id": 7,
    "description": "StoryView by LitPixel is a delightful reading app created for fiction lovers who crave captivating stories in short, personalized formats. It tailors each reading experience to your interests, mood, and pace, letting you immerse yourself in quick yet meaningful tales anytime, anywhere.\n\nExplore a vast library of short stories across genres — romance, sci‑fi, mystery, drama, and fantasy — all curated to match your preferences and reading history. StoryView’s smart recommendation engine learns what you love and continually refines your feed, ensuring every story feels hand‑picked just for you.\n\nThe app’s adaptive reading feature adjusts text flow and pacing based on your reading speed, while clean typography and distraction‑free layouts make every session comfortable and engaging. You can bookmark stories, build personal collections, and share your favorites with friends to spark literary conversations.\n\nWith StoryView, storytelling meets personalization. It transforms spare moments into gateways to imagination, delivering bite‑sized fiction experiences that resonate long after the screen goes dark.",
    "size": 88,
    "reviews": 58,
    "ratingAvg": 4.3,
    "downloads": 8.27,
    "ratings": [
      { "name": "1 star", "count": 65 },
      { "name": "2 star", "count": 80 },
      { "name": "3 star", "count": 170 },
      { "name": "4 star", "count": 310 },
      { "name": "5 star", "count": 335 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/LsfNMwV/mind-dash.png",
    "title": "MindDash",
    "companyName": "NeuroFox",
    "id": 8,
    "description": "MindDash by NeuroFox is a dynamic brain‑training app designed to keep your mind sharp, active, and alert with short daily exercises. Built on neuroscience‑inspired techniques, it offers a collection of interactive games that strengthen memory, enhance logic, and improve focus—all while being fun and engaging.\n\nEach day, MindDash curates a personalized set of challenges that adapt to your skill level. Whether it’s recalling patterns, solving puzzles, or strategizing through logic grids, the app adjusts difficulty in real time to keep your brain stimulated without causing fatigue. Every session takes just a few minutes, making it easy to build cognitive fitness into your daily routine.\n\nDetailed progress analytics let you track improvements across memory, attention, speed, and problem‑solving metrics. You can also join friendly leaderboards or challenge friends to stay motivated as you push your mental performance to new levels.\n\nWith its sleek design, calming interface, and bite‑sized gameplay, MindDash turns brain training into a rewarding habit. Stay focused, think faster, and keep your mind in motion—every day is a new opportunity to sharpen your mental edge.",
    "size": 63,
    "reviews": 64,
    "ratingAvg": 4.6,
    "downloads": 5.08,
    "ratings": [
      { "name": "1 star", "count": 100 },
      { "name": "2 star", "count": 190 },
      { "name": "3 star", "count": 400 },
      { "name": "4 star", "count": 970 },
      { "name": "5 star", "count": 2690 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/8gtLKt4R/plant-pal.png",
    "title": "PlantPal",
    "companyName": "GreenGrid",
    "id": 9,
    "description": "PlantPal by GreenGrid is a smart plant‑care assistant that helps you keep your houseplants healthy, happy, and thriving. Whether you’re a beginner or a seasoned gardener, PlantPal makes nurturing your green companions effortless with intelligent watering reminders, sunlight tracking, and personalized plant insights.\n\nSimply add your plants, and PlantPal builds a custom care schedule based on species, pot size, and environment. The app’s smart reminders notify you when it’s time to water, mist, or fertilize, ensuring your plants always get the attention they need. Using light tracking and growth logs, PlantPal also helps you monitor how much sunlight each plant receives, guiding you to find the perfect spot for optimal growth.\n\nYou can record photos and notes to create a digital journal of your plant’s journey—from sprout to full bloom—and celebrate progress along the way. Cloud sync keeps all your plant data safe and accessible across devices.\n\nWith PlantPal, your home garden practically takes care of itself. Stay organized, reduce stress, and enjoy watching your indoor jungle flourish—one healthy leaf at a time.",
    "size": 70,
    "reviews": 53,
    "ratingAvg": 4.8,
    "downloads": 9.57,
    "ratings": [
      { "name": "1 star", "count": 22 },
      { "name": "2 star", "count": 45 },
      { "name": "3 star", "count": 110 },
      { "name": "4 star", "count": 300 },
      { "name": "5 star", "count": 1163 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/SDHz2pYK/lang-leap.png",
    "title": "LangLeap",
    "companyName": "PolyLingo",
    "id": 10,
    "description": "LangLeap by PolyLingo is an engaging language‑learning app that helps you master new languages naturally through immersive mini‑stories and real‑time pronunciation feedback. Designed to make learning fun, intuitive, and effective, LangLeap lets you dive into everyday conversations instead of boring drills, transforming study sessions into storytelling adventures.\n\nEach bite‑sized story introduces practical vocabulary and grammar in real context, helping you understand how words flow in real speech. Interactive listening and speaking challenges keep you engaged while ensuring you grasp tone, rhythm, and pronunciation. With built‑in speech recognition powered by smart AI, LangLeap analyzes your voice and gives instant feedback, so every lesson improves your fluency step by step.\n\nThe app adapts to your learning pace — whether you’re a beginner building basics or an advanced learner polishing accent and comprehension. Progress trackers, streak goals, and quizzes help you stay motivated and consistent.\n\nWith LangLeap, learning a language feels natural and rewarding. Explore different cultures through stories, speak with confidence, and leap toward fluency one conversation at a time.",
    "size": 95,
    "reviews": 89,
    "ratingAvg": 4.7,
    "downloads": 7.02,
    "ratings": [
      { "name": "1 star", "count": 340 },
      { "name": "2 star", "count": 410 },
      { "name": "3 star", "count": 820 },
      { "name": "4 star", "count": 2400 },
      { "name": "5 star", "count": 7230 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/MvXqVDM/travel-tide.png",
    "title": "TravelTide",
    "companyName": "GlobalSea",
    "id": 11,
    "description": "TravelTide by GlobalSea is your personalized travel companion, designed to help you discover hidden gems, authentic experiences, and local events wherever you go. It goes beyond traditional travel guides, curating unique spots and cultural highlights so every trip feels fresh, meaningful, and tailor‑made for you.\n\nUsing smart location insights, TravelTide recommends places loved by locals — from cozy cafés and secret beaches to art exhibits, festivals, and community gatherings. You can browse by mood, interest, or distance, and create custom itineraries that mix popular landmarks with off‑the‑beaten‑path adventures.\n\nStay updated with real‑time event listings and local happenings, so you never miss an opportunity to connect with the culture around you. Share your favorite discoveries, read traveler reviews, and build collaborative trip lists with friends or fellow explorers.\n\nWith its elegant design and intuitive interface, TravelTide makes trip planning inspiring and effortless. Whether you’re wandering through a new city or rediscovering your hometown, dive into new places, meet new people, and ride the wave of exploration with TravelTide.",
    "size": 110,
    "reviews": 62,
    "ratingAvg": 4.3,
    "downloads": 2.50,
    "ratings": [
      { "name": "1 star", "count": 200 },
      { "name": "2 star", "count": 250 },
      { "name": "3 star", "count": 410 },
      { "name": "4 star", "count": 920 },
      { "name": "5 star", "count": 1320 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/GrVt6xp/cook-mate.png",
    "title": "CookMate",
    "companyName": "KitchenCrafters",
    "id": 12,
    "description": "CookMate by KitchenCrafters is your ultimate kitchen companion — a digital cookbook designed to simplify meal planning, organize your favorite recipes, and make grocery shopping effortless. Thoughtfully crafted for home cooks and food lovers, CookMate brings convenience, creativity, and flavor together in one smart app.\n\nEasily save and categorize recipes, from weeknight dinners to festive desserts, and customize them with your own notes, photos, or ingredient swaps. The smart meal planner helps you schedule dishes throughout the week, balancing taste with nutrition while saving you time. Once your menu is set, CookMate automatically generates a grocery list, neatly categorized by aisle or ingredient type, so your shopping trips are faster and stress‑free.\n\nThe app also features step‑by‑step cooking modes with timers, voice commands, and measurement converters to ensure every dish turns out perfectly. Cloud sync keeps your cookbook accessible across devices, so you can plan meals at home or shop on the go.\n\nWith CookMate, cooking becomes intuitive, organized, and fun — it’s like having a personal sous‑chef that plans, preps, and inspires you every day.",
    "size": 77,
    "reviews": 77,
    "ratingAvg": 4.5,
    "downloads": 3.80,
    "ratings": [
      { "name": "1 star", "count": 18 },
      { "name": "2 star", "count": 25 },
      { "name": "3 star", "count": 95 },
      { "name": "4 star", "count": 150 },
      { "name": "5 star", "count": 242 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/C5p5Yr3b/task-torch.png",
    "title": "TaskTorch",
    "companyName": "FlameWorks",
    "id": 13,
    "description": "TaskTorch by FlameWorks is a dynamic productivity app that helps you turn goals into accomplishments through the power of streak‑based motivation. Designed to make completing your to‑dos exciting and rewarding, TaskTorch transforms task management into a blazing journey of daily progress.\n\nCreate tasks, set deadlines, and visualize your goals with vibrant progress flames that grow stronger with every achievement. Each time you complete a task or meet a milestone, your streak ignites, motivating you to keep the momentum going. Miss a day, and the flame cools — encouraging consistent focus and accountability.\n\nThe app’s intuitive interface lets you organize projects by priority, category, or due date, while insightful analytics track your performance trends over time. Built‑in reminders, color themes, and goal‑tracking tools make staying on task effortless and fun.\n\nWhether you’re managing work projects, personal habits, or long‑term ambitions, TaskTorch keeps your productivity burning bright. Light your goals, fuel your focus, and conquer your to‑do list — one spark at a time.",
    "size": 52,
    "reviews": 48,
    "ratingAvg": 4.4,
    "downloads": 3.04,
    "ratings": [
      { "name": "1 star", "count": 260 },
      { "name": "2 star", "count": 280 },
      { "name": "3 star", "count": 650 },
      { "name": "4 star", "count": 1200 },
      { "name": "5 star", "count": 1710 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/gZc3Xpy7/zen-brush.png",
    "title": "ZenBrush",
    "companyName": "CanvasWhisper",
    "id": 14,
    "description": "ZenBrush by CanvasWhisper is a calming digital art experience designed to help you unwind, focus, and express creativity through brush‑based drawing. Blending gentle sound design with minimalist visuals, ZenBrush transforms sketching into a meditative escape from the noise of everyday life.\n\nEach brushstroke in ZenBrush feels organic and fluid, with responsive textures that mimic real ink, watercolor, or charcoal. The intuitive interface keeps distractions away, allowing you to lose yourself in the motion of painting. Every line, shade, and gesture becomes part of a soothing rhythm supported by ambient background sounds — from soft rain and forest rustles to tranquil chimes.\n\nYou can adjust color palettes, brush dynamics, and paper textures to craft an environment that matches your mood. Finished works can be saved, exported, or re‑visited later for mindful art sessions.\n\nWhether you’re an artist seeking a quiet canvas, or simply someone looking for a peaceful creative outlet, ZenBrush offers serenity through simplicity. Slow down, breathe, and let your imagination flow — one gentle stroke at a time.",
    "size": 90,
    "reviews": 92,
    "ratingAvg": 4.9,
    "downloads": 8.06,
    "ratings": [
      { "name": "1 star", "count": 25 },
      { "name": "2 star", "count": 35 },
      { "name": "3 star", "count": 100 },
      { "name": "4 star", "count": 400 },
      { "name": "5 star", "count": 1540 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/7JkGBB91/ride-ready.png",
    "title": "RideReady",
    "companyName": "MetroPulse",
    "id": 15,
    "description": "RideReady by MetroPulse is your all‑in‑one travel companion for effortless commuting. Designed to simplify public transit navigation, it offers live updates, real‑time schedules, and personalized commute planning — all in a friendly, easy‑to‑use interface.\n\nWhether you take the bus, train, or metro, RideReady keeps you informed every step of the way. Live transit tracking gives you accurate arrival times, service alerts, and route changes so you never miss a connection. With smart commute scheduling, the app learns your daily routine, automatically suggesting the best departure times and fastest routes based on current traffic and transit conditions.\n\nCustomize your favorites to quickly access regular routes, nearby stations, or preferred transit lines. You can even receive push notifications for delays or updates on your usual commute. The clean design, color‑coded maps, and accessibility features make navigating city travel straightforward for everyone.\n\nWith RideReady, getting around the city becomes stress‑free and predictable. Plan smarter, travel faster, and stay in sync with every move — because your commute shouldn’t feel like work.",
    "size": 68,
    "reviews": 71,
    "ratingAvg": 4.1,
    "downloads": 8.03,
    "ratings": [
      { "name": "1 star", "count": 700 },
      { "name": "2 star", "count": 640 },
      { "name": "3 star", "count": 890 },
      { "name": "4 star", "count": 1900 },
      { "name": "5 star", "count": 3170 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/svn8ZrtG/time-tally.png",
    "title": "TimeTally",
    "companyName": "ChronoBits",
    "id": 16,
    "description": "TimeTally by ChronoBits is a sleek, analytical time‑tracking app designed to help you understand and improve your productivity through beautiful visual insights. It transforms how you manage your hours by turning everyday activities into elegant, data‑driven charts that reveal exactly where your time goes.\n\nSimply start tracking your tasks, and TimeTally does the rest — logging sessions, detecting patterns, and displaying your focus trends in intuitive visual dashboards. Its minimalist interface keeps your tracking workflow distraction‑free while offering colorful graphs and timelines that make productivity analysis simple and satisfying.\n\nYou can set goals, categorize activities, and review detailed reports that highlight your efficiency throughout the day or week. Smart summaries show how much time you dedicate to work, rest, and learning, helping you strike a healthier balance.\n\nWhether you’re a freelancer, student, or professional, TimeTally provides clarity and structure to your routine. See your efforts come to life in motion, refine your habits with precision, and make every minute count — because understanding your time is the first step to mastering it.",
    "size": 54,
    "reviews": 84,
    "ratingAvg": 4.5,
    "downloads": 11.52,
    "ratings": [
      { "name": "1 star", "count": 65 },
      { "name": "2 star", "count": 80 },
      { "name": "3 star", "count": 180 },
      { "name": "4 star", "count": 350 },
      { "name": "5 star", "count": 525 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/Q7FD1b5k/pet-patch.png",
    "title": "PetPatch",
    "companyName": "Furwave",
    "id": 17,
    "description": "PetPatch by Furwave is the ultimate companion app for pet owners who want to keep their furry friends happy, healthy, and well‑organized. From tracking vet visits to storing cherished photo memories, PetPatch makes caring for your pet effortless and enjoyable.\n\nEasily record your pet’s health information, vaccinations, medications, and appointments in one convenient place. With smart reminders for upcoming vet visits and medication schedules, you’ll never miss an important date again. The app’s health dashboard gives a clear overview of your pet’s wellbeing, helping you monitor weight, diet, and activity patterns over time.\n\nBeyond health tracking, PetPatch lets you capture and organize adorable moments. Create a personalized timeline filled with photos, milestones, and fun notes that celebrate your pet’s unique journey. You can even share your favorite snapshots and stories with friends or fellow pet lovers directly from the app.\n\nWith PetPatch, pet care becomes simpler, more connected, and full of heart. It’s not just a health tracker—it’s a digital scrapbook for every wag, purr, and paw‑print memory that makes your companion truly special.",
    "size": 48,
    "reviews": 69,
    "ratingAvg": 4.6,
    "downloads": 9.52,
    "ratings": [
      { "name": "1 star", "count": 90 },
      { "name": "2 star", "count": 100 },
      { "name": "3 star", "count": 260 },
      { "name": "4 star", "count": 550 },
      { "name": "5 star", "count": 1280 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/84t7tdg6/art-board.png",
    "title": "ArtBoard",
    "companyName": "SketchSpace",
    "id": 18,
    "description": "ArtBoard by SketchSpace is a dynamic collaborative design platform built for creative teams and independent designers who thrive on visual innovation. It provides an interactive, real‑time canvas where multiple users can brainstorm, sketch, prototype, and refine ideas together — all within a beautifully fluid workspace.\n\nDesigned for effortless teamwork, ArtBoard lets collaborators draw, drag, and annotate simultaneously on shared projects. From wireframes and storyboards to full digital illustrations, every element stays synced so everyone stays on the same creative wavelength. Built‑in version history and comment threads make design feedback organized and transparent, ensuring that creative momentum never slows down.\n\nArtBoard supports vector tools, layered editing, and flexible export options, giving professionals the power of desktop‑grade design in a lightweight, web‑based interface. Cloud storage keeps projects safe and accessible from anywhere, while customizable templates accelerate new ideas.\n\nWhether you’re part of a global studio or an independent freelancer, ArtBoard turns collaboration into creation. It’s more than a digital canvas — it’s a shared creative playground where vision meets precision, and teamwork brings art to life.",
    "size": 130,
    "reviews": 55,
    "ratingAvg": 4.0,
    "downloads": 4.72,
    "ratings": [
      { "name": "1 star", "count": 100 },
      { "name": "2 star", "count": 90 },
      { "name": "3 star", "count": 300 },
      { "name": "4 star", "count": 280 },
      { "name": "5 star", "count": 100 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/PsXJx62h/weather-wing.png",
    "title": "WeatherWing",
    "companyName": "SkyLogic",
    "id": 19,
    "description": "WeatherWing by SkyLogic is a delightful weather app that blends accuracy with a dash of personality. Get precise, real‑time forecasts wrapped in a charming, nature‑inspired experience — complete with cheerful bird mascots that make checking the weather unexpectedly fun.\n\nBehind its friendly design, WeatherWing uses advanced meteorological data and reliable forecasting models to provide detailed hourly, daily, and weekly forecasts. You’ll get updates on temperature, humidity, wind speed, air quality, UV index, and even sunrise or sunset times — all visualized through elegant graphics that make the data easy to understand at a glance.\n\nEach forecast is delivered by your feathery companions — playful bird mascots whose moods and animations reflect the day’s weather. From a joyful bluebird on sunny mornings to a cozy robin on rainy afternoons, they bring a touch of warmth and character to every update.\n\nWith customizable alerts, adaptive themes, and a clean, ad‑free interface, WeatherWing makes staying informed about weather conditions a bright part of your day. Because if you have to check the forecast, why not do it with a few friendly wings by your side?",
    "size": 65,
    "reviews": 74,
    "ratingAvg": 4.8,
    "downloads": 1.05,
    "ratings": [
      { "name": "1 star", "count": 70 },
      { "name": "2 star", "count": 90 },
      { "name": "3 star", "count": 200 },
      { "name": "4 star", "count": 480 },
      { "name": "5 star", "count": 1730 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/0RHLVx2R/read-ripple.png",
    "title": "ReadRipple",
    "companyName": "PageStream",
    "id": 20,
    "description": "ReadRipple by PageStream is a vibrant social platform built for book lovers who enjoy discovering stories and sharing their reading journeys. It transforms reading into a connected experience, letting you explore new titles, write thoughtful reviews, and connect with a global community of passionate readers.\n\nCreate your personal reading profile to showcase your favorite genres, current reads, and completed books. Draft reviews, rate titles, and recommend novels to friends or followers who share your literary taste. Smart recommendations powered by your reading history help you uncover hidden gems—from timeless classics to trending contemporary works—tailored just for you.\n\nJoin lively discussions, follow reviewers you trust, or dive into themed book clubs to keep your bookshelf and your imagination growing. ReadRipple also lets you create reading challenges and track your progress with intuitive stats and milestones, turning your reading goals into rewarding achievements.\n\nWith ReadRipple, every book sparks a new connection. Whether you’re a casual reader or a literature enthusiast, it’s the perfect place to discover stories that move you and share reflections that inspire others.",
    "size": 58,
    "reviews": 52,
    "ratingAvg": 4.3,
    "downloads": 5,
    "ratings": [
      { "name": "1 star", "count": 28 },
      { "name": "2 star", "count": 44 },
      { "name": "3 star", "count": 130 },
      { "name": "4 star", "count": 210 },
      { "name": "5 star", "count": 298 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/bjCChfdf/goal-grid.jpg",
    "title": "GoalGrid",
    "companyName": "AspiraTech",
    "id": 21,
    "description": "GoalGrid by AspiraTech is a motivating social productivity app that helps you set goals, track progress, and celebrate achievements with the people who inspire you most. Designed to turn ambition into action, GoalGrid transforms personal growth into a fun, shared journey of success.\n\nCreate custom goals — from fitness and study plans to career milestones or daily habits — and visualize your progress through intuitive grids and charts. Each goal becomes a living tracker, showing how far you’ve come and what’s left to accomplish. Built‑in reminders and progress streaks keep your momentum strong, while positive prompts help you stay motivated on tough days.\n\nThe social side of GoalGrid lets you connect with friends, form accountability circles, and cheer each other on. You can share updates, exchange tips, and celebrate milestones together, creating a community of support and encouragement.\n\nWith GoalGrid, personal development meets collaboration. Whether you’re chasing big dreams or building better habits, it gives you the tools and motivation to achieve more — because progress feels better when it’s shared.",
    "size": 64,
    "reviews": 93,
    "ratingAvg": 4.5,
    "downloads": 8.34,
    "ratings": [
      { "name": "1 star", "count": 38 },
      { "name": "2 star", "count": 60 },
      { "name": "3 star", "count": 140 },
      { "name": "4 star", "count": 280 },
      { "name": "5 star", "count": 406 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/6Rtr260k/calm-cast.png",
    "title": "CalmCast",
    "companyName": "AudioAura",
    "id": 22,
    "description": "CalmCast by AudioAura is your gateway to serenity — a beautifully crafted app that lets you stream soothing ambient soundscapes for work, sleep, and meditation. Designed to quiet the noise of daily life, CalmCast helps you focus deeply, unwind peacefully, and drift into rest with effortless calm.\n\nImmerse yourself in a curated library of high‑quality sound environments such as gentle rain, ocean waves, forest birdsong, and distant thunder. Each soundscape is finely balanced to create the perfect atmosphere for studying, relaxing, or practicing mindfulness. Mix and match multiple tracks or layer subtle background tones to build your personalized audio sanctuary.\n\nCalmCast also features sleep timers, fade transitions, and playback controls so your experience remains seamless and distraction‑free. Whether you’re improving focus during work sessions, easing anxiety before bed, or meditating into stillness, the app adapts to your rhythm and needs.\n\nWith CalmCast, relaxation is always within reach. Tune in, breathe deeply, and let peaceful sounds wash away the stress of your day—your personal audio retreat awaits wherever you are.",
    "size": 85,
    "reviews": 88,
    "ratingAvg": 4.9,
    "downloads": 4.02,
    "ratings": [
      { "name": "1 star", "count": 18 },
      { "name": "2 star", "count": 27 },
      { "name": "3 star", "count": 75 },
      { "name": "4 star", "count": 280 },
      { "name": "5 star", "count": 1330 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/QFB6mFYq/code-crafter.png",
    "title": "CodeCrafter",
    "companyName": "DevForge",
    "id": 23,
    "description": "CodeCrafter by DevForge is a powerful mobile IDE built for developers who love the freedom to code anywhere, anytime. Designed for productivity and precision on the go, it brings the functionality of a desktop coding environment right to your pocket — so you can write, edit, and debug effortlessly, no matter where inspiration strikes.\n\nSupporting multiple programming languages, CodeCrafter offers syntax highlighting, intelligent autocompletion, and error detection to streamline your workflow. Its clean, minimalist interface keeps your focus on the code while providing quick access to files, terminals, and project settings. Cloud sync ensures your work is always up to date and accessible across devices, while offline mode lets you keep coding even without an internet connection.\n\nBuilt with developers in mind, CodeCrafter includes integrated Git controls for version management, quick deployment options, and customizable themes for a comfortable coding experience.\n\nWhether you’re perfecting a side project, collaborating with a remote team, or learning new languages, CodeCrafter turns your mobile device into a complete development studio. Write smarter, code faster, and build freely — wherever creativity takes you.",
    "size": 150,
    "reviews": 68,
    "ratingAvg": 4.2,
    "downloads": 5.21,
    "ratings": [
      { "name": "1 star", "count": 50 },
      { "name": "2 star", "count": 70 },
      { "name": "3 star", "count": 120 },
      { "name": "4 star", "count": 200 },
      { "name": "5 star", "count": 200 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/6R7D40wf/mind-maple.png",
    "title": "MindMaple",
    "companyName": "CognitiveRoot",
    "id": 24,
    "description": "MindMaple by CognitiveRoot is a powerful mind‑mapping and brainstorming app that helps you visualize your thoughts, organize ideas, and spark creativity. Designed for thinkers, creators, and strategists, it transforms complex concepts into clear, connected visuals so you can plan, explore, and innovate with ease.\n\nStart with a single idea and watch it branch out into a structured map of goals, projects, or creative concepts. MindMaple’s intuitive drag‑and‑drop interface lets you add notes, links, tasks, and images to every node, creating a dynamic workspace that grows with your imagination. Color coding, icons, and themes make organizing thoughts simple and visually engaging, while smart auto‑layout tools keep your maps clean and readable.\n\nWhether you’re managing projects, creating study outlines, or planning business strategies, MindMaple adapts to your workflow with flexible templates and export options for presentations or collaboration. Cloud sync ensures your mind maps are always accessible, whether you’re brainstorming solo or in a team.\n\nWith MindMaple, thinking becomes visual and creativity flows naturally. Turn messy ideas into meaningful connections and see the bigger picture—all from one beautifully organized canvas.",
    "size": 72,
    "reviews": 57,
    "ratingAvg": 4.6,
    "downloads": 7.63,
    "ratings": [
      { "name": "1 star", "count": 62 },
      { "name": "2 star", "count": 89 },
      { "name": "3 star", "count": 190 },
      { "name": "4 star", "count": 370 },
      { "name": "5 star", "count": 719 }
    ]
  }
]